In [182]:
import numpy as np
import pandas as pd

**1\.** Как создать pd.Series из листа, numpy array и словаря(dict)? (★☆☆)

In [183]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

#your code

mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

#your code

print(pd.Series(mylist))
print(pd.Series(myarr))
print(pd.Series(mydict))

0     a
1     b
     ..
24    y
25    z
Length: 26, dtype: object
0      0
1      1
      ..
24    24
25    25
Length: 26, dtype: int64
a     0
b     1
     ..
y    24
z    25
Length: 26, dtype: int64

**2\.** Как сделать превратить индексы из датафрейма в колонку? (★☆☆)

In [184]:
df=pd.DataFrame(['a', 'b', 'c'])

#your code

df['index'] = df.index
print(df)

   0  index
0  a      0
1  b      1
2  c      2

**3\.** Как из нескольких pd.Series сделать один датафрейм? (★★☆)

(hint: pd.concat или словарь с колонками)

In [185]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['aa', 'b1', 'c2'])
df3=pd.Series(['44', '55', '66'])

#your code

pd.concat([df1, df2, df3])

0     a
1     b
     ..
1    55
2    66
Length: 9, dtype: object

**4\.** Как получить строки из series A, которые не содержатся в series B? (★★☆)

In [186]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['a', 'b1', 'c2'])

#your code

df1[~df2.isin(df1)]

1    b
2    c
dtype: object

**5\.** Как получить из series/dataframe минимум, 25й персентиль, медиану, 75тый персентиль, максимум? (★☆☆)

(hint: использовать одну команду)

In [187]:
df1=pd.Series(np.arange(10, 99))

#your code

df1.describe()

count    89.0
mean     54.0
         ...
75%      76.0
max      98.0
Length: 8, dtype: float64

**6\.** Как получить частоту\долю для всех уникальных объектов в series? (★☆☆)

In [351]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code

df1.groupby(df1).count()

a    5
b    2
c    3
g    1
u    1
v    1
dtype: int64

**7\.** Как оставить только топ-2 самых часто встречающихся значений, а все остальные значения заменить на 'other'?  (★★☆)

In [189]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code

df1.replace(df1.value_counts()[2:].index, 'other')

0         a
1     other
      ...
11        c
12        c
Length: 13, dtype: object

**8\.** Как разбить колонку с числовыми значениями на 10 групп одинакового размера?  (★★☆)

(hint: pd.qcut)

In [190]:
s = pd.Series(np.random.random(20))

#your code

pd.qcut(s, 10)

0     (0.204, 0.236]
1     (0.808, 0.976]
           ...
18    (0.236, 0.294]
19    (0.129, 0.157]
Length: 20, dtype: category
Categories (10, interval[float64]): [(0.129, 0.157] < (0.157, 0.204] < (0.204, 0.236] < (0.236, 0.294] ... (0.635, 0.75] < (0.75, 0.808] < (0.808, 0.976] < (0.976, 0.984]]

**9\.** Как найти позиции чисел, которые делятся на 3 без остатка из series?  (★★☆)

(можно с помощью numpy и с помощью pandas)

In [191]:
s = pd.Series(range(20))
s.where(s % 3 == 0).dropna().index

Int64Index([0, 3, 6, 9, 12, 15, 18], dtype='int64')

**10\.** Как извлечь из series строки по индексам?  (★☆☆)

In [192]:
s = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

#your code

s.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

**11\.** Как сделать stack двух series вертикально и горизонтально? (★☆☆)

(hint: pd.append, pd.concat)

In [193]:
s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

#your code


s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

#your code

print(s1.append(s2))
print(pd.concat([s1, s2], axis=1))

0    0
1    1
    ..
3    d
4    e
Length: 10, dtype: object
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

**12\.** Как получить позиции строк из series A из другого series B? (★☆☆)

(можно с помощью numpy и с помощью pandas)

In [194]:
s1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
s2 = pd.Series([1, 3, 10, 13])

#your code

s1.reset_index().merge(s2.rename(0),how='right').set_index(0).sort_index()

    index
0
1       5
3       4
10      0
13      8

**13\.** Как вычислить среднеквадратическую ошибку для истинных и предсказанных значений? (★★☆)

In [195]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

#your code

np.square(truth - pred).mean()

0.5090503790808121

**14\.** Как конвертировать каждый первый элемент строке в series в верхний регистр? (★★☆)

In [196]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code

s.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

**15\.** Как посчитать количество символов в каждой строке? (★★☆)

In [197]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code

s.str.len()

0    3
1    2
2    4
3    4
dtype: int64

**16\.** Как преобразовать даты в виде строк в timeseries?  (★☆☆)

(hint: pd.to_datetime)

In [198]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code

pd.to_datetime(s)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
            ...
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
Length: 6, dtype: datetime64[ns]

**17\.** Как получить день месяца, номер недели, день года и день недели из даты в виде строки? (★★☆)

In [199]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code

s = pd.to_datetime(s)

print("Date: ", s.dt.strftime('%d').astype('int'))

print("Week number: ", s.dt.strftime('%W').astype('int'))

print("Day number of year: ", s.dt.strftime('%j').astype('int'))

print("Day of week: ", s.dt.strftime('%A'))

Date:  0    1
1    2
    ..
4    5
5    6
Length: 6, dtype: int64
Week number:  0     0
1     5
     ..
4    18
5    22
Length: 6, dtype: int64
Day number of year:  0      1
1     33
    ...
4    125
5    157
Length: 6, dtype: int64
Day of week:  0       Friday
1    Wednesday
       ...
4       Monday
5     Saturday
Length: 6, dtype: object

**18\.** Как конвертировать дату из формата месяц-год в формат год-месяц-первое число? (★★☆)

(hint: .strftime('%Y-%m-%d'))

In [200]:
s = pd.Series(['Jan 2017', 'Feb 2019', 'Mar 2012'])

#your code

s = pd.to_datetime(s)
s.dt.strftime('%Y-%m-%d')

0    2017-01-01
1    2019-02-01
2    2012-03-01
dtype: object

**19\.** Как отфильтровать слова, содержащие не менее 2 гласных? (★★☆)

In [201]:
s = pd.Series(['Kitty', 'Cat', 'Plan', 'Python', 'Money'])

#your code

s[s.str.count(r'[aeiou]')>=2]

4    Money
dtype: object

**20\.** Заполните все пропущенные даты от минимальной до максимальной, значения при этом дожны быть равны предыдущей не пропущеной дате (★★★)

In [202]:
s = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

#your code

min_date = s.index.min()
max_date = s.index.max()
date_range = pd.date_range(min_date, max_date)
s_ = pd.Series([np.nan] * len(date_range), index=date_range)
s_[s.index] = s
s_.fillna(method='ffill')

2000-01-01    1.0
2000-01-02    1.0
             ...
2000-01-07    3.0
2000-01-08    3.0
Freq: D, Length: 8, dtype: float64

**21\.** Считайте файл из CSV-файла по строчно и добавьте считанные строки в датафрейм (файл data/BostonHousing.csv)?  (★★☆)

(hint: csv reader)

In [203]:
import csv


with open('titanic.csv', 'r') as csvfile:
    csv_content = csv.reader(csvfile)
    csv_content = [[*row] for row in csv_content]

df = pd.DataFrame(csv_content)
df = df.rename(columns=df.iloc[0]).drop(0)
df.head(5)

  PassengerId Survived  ... Cabin Embarked
1           1        0  ...              S
2           2        1  ...   C85        C
3           3        1  ...              S
4           4        1  ...  C123        S
5           5        0  ...              S

[5 rows x 13 columns]

**22\.** Как изменить значения столбца при импорте csv в фрейм данных?
Импортируйте датасет с помощью pd.read_csv, но колонку 'medv' (median house value) измените так, что если value < 25 = ‘Low’ и если > 25 = ‘High’.  (★★☆)

(hint: pd.read_csv(....., converts={}))

In [204]:
w = lambda x: 'High' if x == 'C' else 'Low'
pd.read_csv('titanic.csv', converters={'Embarked':w})

     PassengerId  Survived  ...  Cabin Embarked
0              1         0  ...    NaN      Low
1              2         1  ...    C85     High
..           ...       ...  ...    ...      ...
154          155         0  ...    NaN      Low
155          156         0  ...    NaN     High

[156 rows x 13 columns]

**23\.** Как импортировать только указанные столбцы('crim' и 'medv') и только n строк из CSV-файла?  (★☆☆)

In [205]:
pd.read_csv('titanic.csv', nrows = 10, usecols = ['Lname'])

      Lname
0    Braund
1   Cumings
..      ...
8   Johnson
9    Nasser

[10 rows x 1 columns]

**24\.** Как получить кол-во строк, кол-во столбцов, тип столбцов, кол-во столбцов с таким типом данных, итоговую статистику каждого столбца датафрейма?  (★☆☆)

In [206]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#  number of rows and columns

rows = len(df)

# datatypes

datatypes = df.dtypes

# how many columns under each dtype

count_dtype = df.dtypes.reset_index().groupby(0).count()

# summary statistics

df.describe()

       Min.Price      Price  ...  Luggage.room       Weight
count  86.000000  91.000000  ...     74.000000    86.000000
mean   17.118605  19.616484  ...     13.986486  3104.593023
...          ...        ...  ...           ...          ...
75%    20.250000  23.500000  ...     16.000000  3567.500000
max    45.400000  61.900000  ...     22.000000  4105.000000

[8 rows x 18 columns]

**25\.** Как извлечь номер строки и столбца конкретной ячейки с заданным критерием? (★☆☆)

In [207]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Get Manufacturer with highest price

df[df['Max.Price'] == df['Max.Price'].max()]['Manufacturer']

# Get Row and Column number

df.iloc[1,[1]]

# Get the value

df[df['Manufacturer'] == 'Mercedes-Benz']

     Manufacturer Model  ...   Origin                Make
57  Mercedes-Benz  190E  ...      NaN  Mercedes-Benz 190E
58  Mercedes-Benz  300E  ...  non-USA  Mercedes-Benz 300E

[2 rows x 27 columns]

**26\.** Переименнуйте колонку Type в CarType, в столбцах с '.' в названии замените её на '_'. Как добавить ко всем названиям колонок суффиксы?  (★☆☆)

In [208]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df.rename({'Type': 'CarType'}, axis='columns')

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

**27\.** Проверьте есть ли в датафрейме пропуски? Если да, посчитайте кол-во nan\none в каждом столбце датафрейма  (★★☆)

In [209]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df.isna().any(), df.isna().sum()

(Manufacturer    True
 Model           True
                 ...
 Origin          True
 Make            True
 Length: 27, dtype: bool,
 Manufacturer    4
 Model           1
                ..
 Origin          5
 Make            3
 Length: 27, dtype: int64)

**28\.** Как заменить отсутствующие значения нескольких числовых столбцов средним?  (★★☆)

In [210]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df.fillna(df.mean())

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

**29\.** Как выбрать конкретный столбец из датафрейма в качестве датафрейма, а не series?  (★☆☆)

In [211]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df[['Model']]

      Model
0   Integra
1    Legend
..      ...
91      240
92      850

[93 rows x 1 columns]

**30\.** Как изменить порядок столбцов данных? (☆☆☆)

In [212]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df[['Model','Manufacturer']]

      Model Manufacturer
0   Integra        Acura
1    Legend          NaN
..      ...          ...
91      240        Volvo
92      850          NaN

[93 rows x 2 columns]

**31\.** Как установить количество строк и столбцов, отображаемых в выводе? (☆☆☆)

(hint: pd.set_option)

In [213]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

pd.options.display.max_rows = 5
pd.options.display.max_columns = 5
df

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

 **32\.** Как получить номер строки, в которой содержится максимальное значение в столбце? (★★☆)

In [214]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

#your code

print(df)

np.unravel_index(df.to_numpy().argmax(), df.shape)

     a   b   c
0   29   7  20
1    7   5  15
..  ..  ..  ..
8   29   7  19
9   25  18  15

[10 rows x 3 columns]

(0, 0)

** 33\. Как получить последние n строк датафрейма с суммой строк 100?  (★★★)

In [215]:
df['sum'] = df['a']+df['b']+df['c']
n = len(df)-1
summ = 0
while summ < 100:
    summ += df['sum'].iloc[n]
    n -= 1

In [216]:
n

7

### Выбросы (оutliers)

* 5 Ways to Detect Outliers/Anomalies That Every Data Scientist Should Know (Python Code)

https://towardsdatascience.com/5-ways-to-detect-outliers-that-every-data-scientist-should-know-python-code-70a54335a623

**34\.** Как найти и заменить выбросы из столбца Series или датафрейма? (★★★)

Замените все значения из столбца ниже 5того и больше 95го персентиля, на пограничные значения.

(hint: .quantile())

In [217]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code

s[s<s.quantile(0.5)] = s.quantile(0.5)
s[s>s.quantile(0.95)] = s.quantile(0.95)
s

0      1.012635
1      1.012635
        ...
28    63.876672
29    63.876672
Length: 30, dtype: float64

**35\.** Попробуйте реализовать метод Interquartile Range (IQR) (★★★)

Почитать про него можно по ссылке выше.

In [218]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code

q1 = s.quantile(q=0.25)
q3 = s.quantile(q=0.75)

iqr = q3 - q1
s[(s > q1 - 1.5*iqr) & (s < q3 + 1.5*iqr)]

0      0.010000
1      0.013738
        ...
23    14.873521
24    20.433597
Length: 25, dtype: float64

**36\.** Как поменять местами две строки данных? (★★★)

In [219]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

#your code

df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [220]:
n, m = df.iloc[0].copy(), df.iloc[1].copy()
df.iloc[0], df.iloc[1] = m, n
df

    0   1   2   3   4
0   5   6   7   8   9
1   0   1   2   3   4
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

### one-hot-encoding

**37\.** Как создать однозначные кодировки категориальной переменной? (★★★)

Сделайте one-hot кодировку столбца 'a'.

In [221]:
df = pd.DataFrame([['aa', 'kek'], ['ba', 'lol'], ['ab', 'kek'], ['aa', 'lol'], ['cc', 'kek']], columns=['a', 'b'])

#your code

df = df.join(pd.get_dummies(df['a']))
df.drop('a',1)

     b  aa  ab  ba  cc
0  kek   1   0   0   0
1  lol   0   0   1   0
2  kek   0   1   0   0
3  lol   1   0   0   0
4  kek   0   0   0   1

**38\.** Нормализуйте все столбцы в датафрейме. (★★★)

a) Нормализовать все столбцы df путем вычитания среднего значения столбца и деления на стандартное отклонение. 

b) Трансформируйте все столбцы df так, чтобы минимальное значение в каждом столбце было 0, а max = 1.

In [222]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

#your code

In [223]:
# a)
(df - df.mean()) / df.std()

           0         1  ...         8         9
0   0.944173  1.073748  ...  0.531280  0.229006
1  -0.525949  0.644249  ...  0.000000  1.222658
..       ...       ...  ...       ...       ...
6   0.640010 -1.503247  ... -0.106256 -0.454130
7   0.640010 -0.987848  ... -1.806351  1.564226

[8 rows x 10 columns]

In [224]:
# b)
(df - df.min()) / (df - df.min()).max()

           0         1  ...         8         9
0   1.000000  1.000000  ...  0.758621  0.475610
1   0.482143  0.833333  ...  0.586207  0.865854
..       ...       ...  ...       ...       ...
6   0.892857  0.000000  ...  0.551724  0.207317
7   0.892857  0.200000  ...  0.000000  1.000000

[8 rows x 10 columns]

**39\.** Как получить конкретную группу из датафрейма сгруппированного по ключу? (★★★)

Сгруппируйте по 'name', и выведите данные по группе 'orange'.

(hint: groupby(), get_group())

In [225]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code

df.groupby('name').get_group('orange')

     name     taste  price
2  orange  0.083916      1
5  orange  0.696292      9
8  orange  0.469928      9

**40\.** Как вычислить среднее значение по столбцу 'price' по каждому фрукту в датафрейме и сохранить сгруппированный столбец как другой столбец (не индекс)? (★★★)

In [226]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code

pd.merge(df,df.groupby('name').mean().reset_index()[['name','price']],left_on='name',right_on='name')

      name     taste  price_x    price_y
0    apple  0.773397        2   7.000000
1    apple  0.128187        5   7.000000
..     ...       ...      ...        ...
7   orange  0.329737       11  10.666667
8   orange  0.365280        9  10.666667

[9 rows x 4 columns]

**41\.** Как объединить два датафрейма по двум столбцам, чтобы в них остались только общие строки?  (★★★)

Сделать merge двух датафреймов по колонкам ['fruit', 'weight'] и ['pazham', 'kilo'].

(hint: pd.merge https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#merge )

In [227]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

#your code

pd.merge(df1, df2, left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'])

     fruit weight  ...  kilo price_y
0    apple   high  ...  high       9
1    apple   high  ...  high       9
..     ...    ...  ...   ...     ...
4   orange    low  ...   low       3
5   orange    low  ...   low       3

[6 rows x 6 columns]

**42\.** Как удалить строки из датафрейма А, которые присутствуют в датафрейме B? (★★★)

In [228]:
df1 = pd.DataFrame({'fruit': ['apple', 'orange', 'banana'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.arange(9)})

df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'medium'] * 3,
                    'price': np.arange(6)})

#your code

print(df1, '\n' * 2, df2)

df1[~df1.isin(df2).all(axis=1)]

     fruit  weight  price
0    apple    high      0
1   orange  medium      1
..     ...     ...    ...
7   orange  medium      7
8   banana     low      8

[9 rows x 3 columns]

      fruit  weight  price
0    apple    high      0
1   orange  medium      1
..     ...     ...    ...
4   orange    high      4
5     pine  medium      5

[6 rows x 3 columns]

     fruit  weight  price
2   banana     low      2
3    apple    high      3
..     ...     ...    ...
7   orange  medium      7
8   banana     low      8

[7 rows x 3 columns]

**43\.** Как получить номера строк, в которых совпадают значения двух столбцов? (★★★)

(hint: np.where)

In [229]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})


#your code

print(df)

    fruit1  fruit2
0   orange   apple
1    apple  orange
..     ...     ...
8    apple  orange
9   orange  orange

[10 rows x 2 columns]

In [230]:
df.where(df['fruit1'] == df['fruit2']).dropna().index

Int64Index([2, 4, 6, 9], dtype='int64')

**44\.** Создайте столбец a_shift со сдвигом на одну строку назад. (★★★)

(hint: .shift())

In [231]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

#your code

df

    a   b   c   d
0  42  46  14   2
1  57  84  98  43
2  47  67  96  43
3  17  81  24  54
4  93  85  24  24

In [232]:
df['a_shift'] = df['a'].shift(axis=0)
df

    a   b   c   d  a_shift
0  42  46  14   2      NaN
1  57  84  98  43     42.0
2  47  67  96  43     57.0
3  17  81  24  54     47.0
4  93  85  24  24     17.0

**45\.** Как разбить текстовый столбец на три отдельных столбца? (★★★)

Разбить на три столбцы STD, City, State

In [233]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

#your code

splitter = lambda x : [xxs for xs in x.split(',') for xxs in xs.strip().split('    ')]
cols = splitter(df['row'][0])
df = df.drop(0)
df = pd.DataFrame([splitter(x) for x in df['row']], columns=cols)
df

  STD       City        State
0  33    Kolkata  West Bengal
1  44    Chennai   Tamil Nadu
2  40  Hyderabad    Telengana
3  80  Bangalore    Karnataka

### **46\.** Ну а теперь все вместе.  (★★★★★★★★★★)

* Заменяем все точки в названии на '_'
* Выделить категориальные признаки
* Посчитать кол-во уникальных значений во всех текстовых\категориальных столбцах. 
* Колонки с только уникальными значениями удаляем (например Model и Make)
* Для столбцов у которых значений более 10, оставляем топ 10 значений, остальные заменяем на 'other'
* Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце
* Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.
* Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'
* Все категориальные признаки превращаем в one-hot-encoding
* Создать новый столбец Length_Width = Length * Width
* Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785)  / (MPG * 1,609)
* Посчитать среднюю цену по каждому типу машины у каждого производителя
* Посчитать максимальные Length и Width по Type
* Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)
* Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)
* Посчитать кол-во машин по Manufacturer-Man_trans_avail
* Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам

In [276]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

df

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

In [277]:
# Замена точек на '_'


df.columns = df.columns.str.replace('.', '_', regex=False)
df

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

In [281]:
# Выделение категориальных признаков

cat_cols = df.select_dtypes(exclude='number').columns
cat_cols_w_suffix = cat_cols + '_cat'
mapping = dict(zip(cat_cols, cat_cols_w_suffix))
df = df.rename(columns=mapping)

In [282]:
# Количество уникальных значений во всех текстовых/категориальных столбцах

cat_cols = df.select_dtypes(exclude='number').columns
df[cat_cols].nunique()

Manufacturer_cat    31
Model_cat           92
                    ..
Origin_cat           2
Make_cat            90
Length: 9, dtype: int64

In [283]:
# Колонки с только уникальными значениями удаляем (например Model и Make)

not_unique_cols = df.columns[~(df.nunique() == df.count())]
df = df[not_unique_cols]

In [284]:
# Для столбцов у которых значений более 10, оставляем топ 10 значений, остальные заменяем на 'other'

cat_cols = df.select_dtypes(exclude='number').columns

gt_10_unique = df[df[cat_cols].columns[df[cat_cols].nunique() > n]]

for col in gt_10_unique:
    top_10_values = df[col].value_counts().nlargest(n).index
    df[col][~df[col].isin(top_10_values)] = 'other'

df

   Manufacturer_cat Type_cat  ...  Weight  Origin_cat
0             other    Small  ...  2705.0     non-USA
1             other  Midsize  ...  3560.0     non-USA
..              ...      ...  ...     ...         ...
91            other  Compact  ...  2985.0     non-USA
92            other  Midsize  ...  3245.0     non-USA

[93 rows x 25 columns]

In [285]:
# Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце

num_cols = df.select_dtypes(include='number').columns
nan_part_df = pd.DataFrame(df[num_cols].isna().sum() / len(df), columns=['nan_part'])
nan_part_df

              nan_part
Min_Price     0.075269
Price         0.021505
...                ...
Luggage_room  0.204301
Weight        0.075269

[18 rows x 1 columns]

In [286]:
# Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.

num_cols = df.select_dtypes(include='number').columns
for col in num_cols:
    col_series = df[col]
    q05 = col_series.quantile(q=0.05)
    q95 = col_series.quantile(q=0.95)
    col_series.loc[col_series < q05] = q05
    col_series.loc[col_series > q95] = q95
    df.loc[:, col] = col_series
df

/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

   Manufacturer_cat Type_cat  ...  Weight  Origin_cat
0             other    Small  ...  2705.0     non-USA
1             other  Midsize  ...  3560.0     non-USA
..              ...      ...  ...     ...         ...
91            other  Compact  ...  2985.0     non-USA
92            other  Midsize  ...  3245.0     non-USA

[93 rows x 25 columns]

In [287]:
# Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'

num_cols = df.select_dtypes(include='number').columns
df[num_cols] = df[num_cols].fillna(df[num_cols].mean())

cat_cols = df.select_dtypes(exclude='number').columns
df[cat_cols] = df[cat_cols].fillna('other')

df

   Manufacturer_cat Type_cat  ...  Weight  Origin_cat
0             other    Small  ...  2705.0     non-USA
1             other  Midsize  ...  3560.0     non-USA
..              ...      ...  ...     ...         ...
91            other  Compact  ...  2985.0     non-USA
92            other  Midsize  ...  3245.0     non-USA

[93 rows x 25 columns]

In [288]:
# Все категориальные признаки превращаем в one-hot-encoding

for col in cat_cols:
    one_hot = pd.get_dummies(df[col])
    df = df.join(one_hot, rsuffix='_one_hot')
df.drop(columns=cat_cols, inplace=True)
df

    Min_Price  Price  ...  non-USA  other_one_hot
0        12.9   15.9  ...        1              0
1        29.2   33.9  ...        1              0
..        ...    ...  ...      ...            ...
91       21.8   22.7  ...        1              0
92       24.8   26.7  ...        1              0

[93 rows x 57 columns]

In [289]:
# Создать новый столбец Length_Width = Length * Width

df['Length_Width'] = df['Length'] * df['Width']
df

    Min_Price  Price  ...  other_one_hot  Length_Width
0        12.9   15.9  ...              0       12036.0
1        29.2   33.9  ...              0       13845.0
..        ...    ...  ...            ...           ...
91       21.8   22.7  ...              0       12730.0
92       24.8   26.7  ...              0       12696.0

[93 rows x 58 columns]

In [290]:
# Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785) / (MPG * 1,609)

df['MPG_city'] = (100 * 3.785) / (df['MPG_city'] * 1.609)
df.rename(columns={'MPG_city': 'LPG_city'}, inplace=True)

df['MPG_highway'] = (100 * 3.785) / (df['MPG_highway'] * 1.609)
df.rename(columns={'MPG_highway': 'LPG_highway'}, inplace=True)

df

    Min_Price  Price  ...  other_one_hot  Length_Width
0        12.9   15.9  ...              0       12036.0
1        29.2   33.9  ...              0       13845.0
..        ...    ...  ...            ...           ...
91       21.8   22.7  ...              0       12730.0
92       24.8   26.7  ...              0       12696.0

[93 rows x 58 columns]

In [291]:
# Посчитать среднюю цену по каждому типу машины у каждого производителя

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.groupby(['Manufacturer', 'Type']).mean()['Price']

Manufacturer  Type
Acura         Small      15.9
Audi          Compact    29.1
                         ...
Volkswagen    Van        19.7
Volvo         Compact    22.7
Name: Price, Length: 75, dtype: float64

In [292]:
# Посчитать максимальные Length и Width по Type

df.groupby('Type').max()[['Length', 'Width']]

         Length  Width
Type
Compact   190.0   69.0
Large     219.0   78.0
...         ...    ...
Sporty    193.0   74.0
Van       194.0   78.0

[6 rows x 2 columns]

In [293]:
# Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)

df.groupby(['Type', 'AirBags']).count()['Model']

Type     AirBags
Compact  Driver & Passenger    2
         Driver only           8
                              ..
Van      Driver only           3
         None                  6
Name: Model, Length: 15, dtype: int64

In [294]:
# Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)

df.groupby(['Manufacturer', 'Type']).count()['Model']

Manufacturer  Type
Acura         Small      1
Audi          Compact    1
                        ..
Volkswagen    Van        1
Volvo         Compact    1
Name: Model, Length: 75, dtype: int64

In [295]:
# Посчитать кол-во машин по Manufacturer-Man_trans_avail


df.groupby(['Manufacturer', 'Man.trans.avail']).count()['Model']

Manufacturer  Man.trans.avail
Acura         Yes                1
Audi          Yes                1
                                ..
Volkswagen    Yes                4
Volvo         Yes                1
Name: Model, Length: 41, dtype: int64

In [296]:
# Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам

df.groupby(['Manufacturer', 'Model']).max()['Passengers']

Manufacturer  Model
Acura         Integra    5.0
Audi          100        6.0
                        ...
Volkswagen    Passat     5.0
Volvo         240        5.0
Name: Passengers, Length: 88, dtype: float64

**47\.** Перевести индексы первого и третьего уровня в колонки

In [2]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

                       date_of_birth            name  weight
t_id school_code class
t1   s001        V        15/05/2002  Alberto Franco      35
t2   s002        V        17/05/2002    Gino Mcneill      32
t3   s003        VI       16/02/1999     Ryan Parkes      33
t4   s001        VI       25/09/1998    Eesha Hinton      30
t5   s002        V        11/05/2002    Gino Mcneill      31
t6   s004        VI       15/09/1997    David Parkes      32

In [297]:
df1.reset_index()

    index   fruit  weight  price
0       0   apple    high      0
1       1  orange  medium      1
..    ...     ...     ...    ...
7       7  orange  medium      7
8       8  banana     low      8

[9 rows x 4 columns]

**48\.** Вывести строку из Series и DataFrame по заданному индексу

In [303]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})

indx = 4

In [304]:
ds.iloc[indx]

9

In [305]:
df.iloc[indx]

school_code              s002
class                       V
name             Gino Mcneill
date_of_birth      11/05/2002
weight                     31
Name: 4, dtype: object

**49\.** Найти индексы строк с пропущенными данными

In [309]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
..         ...   ...             ...           ...     ...
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN

[6 rows x 5 columns]

In [308]:
df[df.isna().any(1)].index

Index(['t2', 't6'], dtype='object')

**50\.** Сделать left join датафреймов

In [312]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

In [313]:
data1.merge(data2, how ='left')

  key1 key2  ...    R    S
0   K0   K0  ...   R0   S0
1   K0   K1  ...  NaN  NaN
2   K1   K0  ...   R1   S1
3   K1   K0  ...   R2   S2
4   K2   K1  ...  NaN  NaN

[5 rows x 6 columns]

**51\.** Соединить два датафрейма

In [317]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [320]:
data1.join(data2, how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

**52\.** Сгруппировать датафрейм по полям 'customer_id' и 'salesman_id' и отсортировать по sum of purch_amt внутри каждой группы

In [321]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [322]:
df.groupby(['customer_id', 'salesman_id']).sum().sort_values('purch_amt', ascending = 'True')

                         ord_no  purch_amt
customer_id salesman_id
3005        5007          70011      75.29
3001        5003          70004     110.50
...                         ...        ...
3005        5003          70003    2480.40
            5001         210023    8870.86

[9 rows x 2 columns]

**53\.** Сгруппировать датафрейм по месяцу и году из даты ord_date и найти общее количество заказов по годам и по месяцам

In [323]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [324]:
df['month'] = pd.to_datetime(df['ord_date']).dt.strftime('%m')
df['year'] = pd.to_datetime(df['ord_date']).dt.strftime('%Y')
df.groupby(['month','year']).count()

            ord_no  purch_amt  ord_date  customer_id  salesman_id
month year
04    2012       1          1         1            1            1
05    2012       1          1         1            1            1
...            ...        ...       ...          ...          ...
10    2012       3          3         3            3            3
      2013       1          1         1            1            1

[10 rows x 5 columns]

# Regular expressions with Pandas

**1\.** Выделить в отдельную колонку event_id первую цифру в кавычках, во вторую колонку event_probability вероятность (★☆☆)

In [325]:
df=pd.DataFrame({'col1':["{'34': 0.9839372122311848}",
                         "{'77': 0.6724645988404411}",
                         "{'77': 0.6491011266207006}",
                         "{'77': 0.6123085784265466}",
                         "{'34': 0.87}",
                         "{'77': 0.6225699652019304}",
                         "{'3': 0.5470808226524633}",
                         "{'77': 0.6233849004135044}",
                         "{'77': 0.7050888998743866}",
                         "{'52': 0.8945052223205372}"]})

#your code

df['event_id']=df['col1'].str.extract(r'((?<=\')\d)')
df['event_probability']=df['col1'].str.extract(r'((?<=: )[\d|.]*)')
df

                          col1 event_id   event_probability
0   {'34': 0.9839372122311848}        3  0.9839372122311848
1   {'77': 0.6724645988404411}        7  0.6724645988404411
..                         ...      ...                 ...
8   {'77': 0.7050888998743866}        7  0.7050888998743866
9   {'52': 0.8945052223205372}        5  0.8945052223205372

[10 rows x 3 columns]

**2\.** Удалите все тэги, переносы строк из текстов новостей (★★★)

(hint: df.column.str())

In [329]:
df = pd.read_excel('news.xlsx')

#your code

df.text = df.text.str.replace(r'<.*>|\n','')

df

                                                 text
0         Сообщение о существенном факте         о...
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...
..                                                ...
18            Samsung Heavy Industries      постав...
19        В администрации Краснодарского края подв...

[20 rows x 1 columns]

**3\.** Проставьте флаг в колонку source_ria если текст новости содержит: риа новости, тасс, коммерсант. Перед поиском переведите тексты в lower и удалите все кроме букв. Данные после чистки из предыдушего задания (★★★)

(hint: df.column.str())

In [335]:
pd.options.display.max_rows = 25
txts = df['text'].str.lower()
df['source_ria'] = txts.str.match(r'.*(риа новости|тасс|коммерсант).*')
df

                                                 text  source_ria
0         Сообщение о существенном факте         о...       False
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...       False
2             УЛЬЯНОВСК, 3 декабря 2019, 11:38 - R...       False
3         Самарская область признана одним из лиде...       False
4             Окружная администрация Якутска подпи...       False
5         Во время рабочей поездки по Смоленску и ...       False
6         Сегодня ВВП России на 17 процентов напол...       False
7                  Уфа        ,         4 декабря ...       False
8         МИНЕРАЛЬНЫЕ ВОДЫ /Ставропольский край/, ...        True
9             04 декабря в большом зале          а...       False
10        Конкурс на реконструкцию ВПП-2 в новосиб...        True
11        Название компании: Непубличное акционерн...       False
12        МОСКВА, 4 дек - РИА Новости/Прайм.Россий...        True
13        МОСКВА, 4 декабря./ТАСС/.       Топливна...        True
14        В этом году в Калтасинском районе агрохо...       False
15                 София        ,         4 декабр...       False
16        дата: on источник:       Управление по с...       False
17            НУР-СУЛТАН      .       КАЗИНФОРМ   ...       False
18            Samsung Heavy Industries      постав...        True
19        В администрации Краснодарского края подв...       False

**4\.** Отфильтруйте строки с валидными емейлами (★★★)

In [341]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com', 'kek lol@mail.ru'])

#your code

import re
emails[emails.apply(lambda x: bool(re.fullmatch(r'\w{1,}@[a-z]{1,}\.(com|co|ru)',x)))]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

**5\.** Напишите паттерн для поиска строки содержащей только буквы в верхнем и нижнем регистре, цифры и подчеркивание

In [345]:
pattern = r"^[\w|\d|_]*$"
ch = "sss_zzz_sss"
print(re.match(pattern, ch))
ch_spaced = "sss zzz_sss"
re.match(pattern, ch_spaced)

<re.Match object; span=(0, 11), match='sss_zzz_sss'>

**6\.** Замените пробелы на подчеркивание и наоборот

In [346]:
st = "s sdf_ s"
st.replace(r'_', ' ')
st.replace(r' ', '_')

's_sdf__s'

**7\.** Найдите слова длиной 3,4,5

In [349]:
sz = "Opyat za raboty"
re.findall(r'\b\w{3,5}\b',sz)

['Opyat']

**8\.** Сделайте регистронезависимую замену(replace) во входной строке

In [350]:
sz = "Opyat za raboty"
re.sub(r'Privet', 'xxx', sz, flags=re.IGNORECASE)

'Opyat za raboty'